In [2]:
import pandas as pd
import numpy as np

In [3]:
## Series : It is one dimensional labelled array that can hold any type of data ##

In [5]:
s = pd.Series(np.random.rand(5))

In [6]:
s

0    0.292790
1    0.553280
2    0.046081
3    0.397644
4    0.098913
dtype: float64

In [7]:
s[1]

0.5532802113672404

In [8]:
s[1:]

1    0.553280
2    0.046081
3    0.397644
4    0.098913
dtype: float64

In [9]:
s[:3]

0    0.292790
1    0.553280
2    0.046081
dtype: float64

In [10]:
s[:-1]

0    0.292790
1    0.553280
2    0.046081
3    0.397644
dtype: float64

In [12]:
s[0] = 500

In [13]:
s

0    500.000000
1      0.553280
2      0.046081
3      0.397644
4      0.098913
dtype: float64

In [14]:
s.index = ['1','2','3','4','5']

In [15]:
s

1    500.000000
2      0.553280
3      0.046081
4      0.397644
5      0.098913
dtype: float64

In [16]:
## creating series using dictionary ##

In [18]:
d = {'a':1, 'b':2, 'c':3, 'd':4}
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [20]:
e = pd.Series(d)

In [21]:
e

a    1
b    2
c    3
d    4
dtype: int64

## DataFrame ##

In [22]:
## creating a data frame of two series ##

In [23]:
s1 = pd.Series(np.random.rand(5))
s2 = pd.Series(np.random.rand(5))

In [24]:
s1

0    0.103129
1    0.636125
2    0.729909
3    0.038938
4    0.861541
dtype: float64

In [25]:
s2

0    0.155612
1    0.163625
2    0.062612
3    0.440042
4    0.231957
dtype: float64

In [26]:
a = pd.DataFrame([s1, s2])

In [27]:
a

          0         1         2         3         4
0  0.103129  0.636125  0.729909  0.038938  0.861541
1  0.155612  0.163625  0.062612  0.440042  0.231957

In [28]:
a.columns = ['a', 'b', 'c', 'd', 'e']

In [29]:
a

          a         b         c         d         e
0  0.103129  0.636125  0.729909  0.038938  0.861541
1  0.155612  0.163625  0.062612  0.440042  0.231957

In [30]:
a.index = ['1','2']

In [31]:
a

          a         b         c         d         e
1  0.103129  0.636125  0.729909  0.038938  0.861541
2  0.155612  0.163625  0.062612  0.440042  0.231957

In [32]:
## creating a data frame using dictionary ##

In [33]:
d = {'age':[22,32,42], 'salary':[1000, 2000, 3000]}
d

{'age': [22, 32, 42], 'salary': [1000, 2000, 3000]}

In [34]:
df = pd.DataFrame(d)

In [35]:
df

   age  salary
0   22    1000
1   32    2000
2   42    3000

In [36]:
df['gender'] = ['Male','Female','Male']

In [37]:
df

   age  salary  gender
0   22    1000    Male
1   32    2000  Female
2   42    3000    Male